package edu.nuc.vincent.com.todaynews.bean;

import java.util.List;

/**
 * Created by Vincent on 2018/6/27.
 */

public class Search {

    /**
     * retcode : 000000
     * data : [{"commentCount":0,"viewCount":0,"dislikeCount":0,"tags":null,"likeCount":0,"content":"\n\n\n\n\n\n叁品姐姐每天分享一段爱情感悟，幸福可以很简单，点击右上角关注\u201c叁品姐姐的小幸福\u201d。1 一生不喜与人抢，但该得到的也不会让。2 我可以笑着给你讲道理，也可以翻脸告诉你什么叫规矩。3 打破自己原则和底线坚持的感情，结局一定会烂尾。4 哪有什么感同身受，谁不是针扎在身上才知道痛。5 你不喜欢我，这是病，得治。我喜欢你，这也是病，没得治。6 我从来都没被人骗过，因为骗我的都不是人。7 迟睡，是因为没有勇气结束这一天；赖床，是因为没有勇气开始这一天。8 光头强砍不到树，灰太狼吃不到羊，就像你永远不会爱我。9 爱和喜欢的区别很简单，如果你爱花，你会给它浇水，喜欢则会摘下它。10 不必对每个人都好，他们又不给你打钱！11 哪有什么岁月静好，不过是有人替你负重前行。12 不要太乖，不想做的事可以拒绝，做不到的事不用勉强，不喜欢的话假装没听见，你的13 人生不是用来讨好别人，而是善待自己。更多情感美学、更多爱情感悟，和叁品姐姐一起成长，点击下方\u201c了解更多\u201d\n\n\n\n","url":"http://toutiao.com/group/6570491501753664003/","imageUrls":["http://p1.pstatp.com/large/pgc-image/1529811707863f53b519459","http://p3.pstatp.com/large/pgc-image/15298117084151b47ddda21","http://p1.pstatp.com/large/pgc-image/152981170878549cc4c2ac5","http://p3.pstatp.com/large/pgc-image/1529811709276a1183a3c21"],"coverUrl":"http://p1.pstatp.com/list/pgc-image/152981170878549cc4c2ac5","posterId":"60433889019_1567543265913858","posterScreenName":"叁品姐姐的小幸福","title":"最近微信上很火的霸气句子，一生不喜与人抢，但该得到的也不会让","publishDate":1530060994,"id":"6570491501753664003","publishDateStr":"2018-06-27 08:56:34"},{"commentCount":0,"viewCount":0,"dislikeCount":0,"tags":null,"likeCount":0,"content":"\n\n\n\n\n\n作者：得到 CEO 脱不花得到作者：经济学者薛兆丰2018年6月15\u201318日，得到App在北京的三源里菜市场，举办了一场名为《菜市场遇见经济学》的跨界艺术展。所有的参加者、支持者，谢谢你。所有给我们好评的朋友，谢谢你。很多人都意识到，这件事的背后好像有点新东西。我们也觉得是。下面，就把我们认识到的那些新东西，和盘托出，和你分享：1. 知识产品化，还有很大的想象空间。 知识的载体只能是书、是课吗？当然不是。我们一直在试图突破。知识产品，可能是一场公共展览、一台综艺节目、一部院线电影，甚至可能是一座知识大mall、一个主题乐园。知识的魅力将以各种形式被呈现。知识产品的形态将会加速演化。未来，这条赛道的产业机会将不受限于形态，只受限于想象。2. 消费升级靠体验，体验升级靠知识。过去20年，商业主题词是\u201c流量\u201d。未来，可能要加入一个词：\u201c知识\u201d。人们只要不具备对某个领域的认知，就不可能唤起新的需求，更不可能开启对这个领域的消费。就好比如果一个人没学过艺术知识，他就不可能投资艺术收藏；一个人不懂保险知识，他永远不会投保高额的商业保险。如果你听过薛兆丰对菜市场里的经济学奥秘的解读，你从此会对日常买菜这件事都产生完全不同的体验。知识将不再是纸面上、庙堂上的东西了。知识将会和越来越多的具体场景结合，成为商业的新驱动力。3. 最好的创意，是回归本源。 很多人夸我们，这次活动非常有创意。创意，是做不一样的事吗？不是。最好的创意，是回归这件事本来就应该的样子。每件事都有所谓\u201c行业通行做法\u201d。比如说开新书发布会，行业通行做法就是在书店或者酒店。为什么呢？因为客观规律、资源限制、行业分工、目标异化等等各种原因。但我们总该追问：它本来的样子应该是什么？我们觉得是：让一本书承载的知识，还原到它最合适的场景里去。一本美食书，就应该在一场盛宴上发布；一本历史书，也许应该为它专门排演一场话剧；一本金融题材的书上市，也许应该为它组织一个去意大利寻找银行起源的旅行团。顺着这个思路，就不难想到：一本经济学讲义，应该在菜市场发布。真正的难点，不在于想出新创意。真正的难点，是回到本源，同时有勇气对\u201c行业惯例\u201d视而不见。4. 时间尺度，决定创意能力。你看待一件事情的时间尺度，决定它在多大程度上能回归本源。以这次首发《薛兆丰经济学讲义》为例：如果以一场线下活动本身的时间为尺度，比如2个小时，那么目标就会异化成\u201c把更多人搞到现场\u201d。事实上，有很多发布会就是这么办的。如果以一个月为时间尺度，那么目标就会变成\u201c把这本书卖得更多\u201d。事实上，很多公司就是这么想的。但是，如果以10年为时间尺度，那么，目标就是\u2014\u2014让每个人都能在最日常的生活中体会到经济学的魅力，体验用经济学思维来解构世界的乐趣，吸引越来越多的人学习经济学。看起来很虚幻的一个目标。但是，这种目标才能够指导我们做对的事情，同时还能让我们把事情做对。这并不排斥商业目的。因为越多人爱上经济学，那么薛兆丰作为第一大经济学课堂的主讲老师，就越会获得头部红利。 5. 所有行业都在涌现\u201c高自尊物种\u201d。以往我们理解别的公司的维度，往往非常\u201c势利\u201d且狭隘：大公司还是小公司？名公司还是新公司？国际公司还是本土公司？传统公司还是互联网公司？有钱的公司还是没钱的公司？如此等等。但是，这些维度实际上无法帮你筛选合作伙伴。我们注意到：这个时代，每个行业都出现了\u201c高自尊物种\u201d。这些公司不见得大，不见得富有，但是它们无论对自己还是对用户，都有独特的要求。即使在菜市场，也有这样的\u201c高自尊物种\u201d。我们这次展览的所在地\u2014\u2014北京三源里菜市场，就是一个有品牌自觉和文化自信的菜市场。他们很清楚地知道自己不仅仅是个菜市场，还是一个生活方式的地标，一个民生服务的象征。不仅有了不起的生意传统，而且被人们寄托了关于菜市场的所有美好想象。有了这样的\u201c高自尊认知\u201d，才会对所有大尺度的创意保持开放。他们的开放甚至表现为：没有收取一分钱的场地租金，而在这个展览结束后，他们自己拿出预算，把这个展览的大部分装置，改为永久保留。也许在不久的将来，你可以随时到三源里看一个永久的经济学展了。 这样的\u201c高自尊物种\u201d，也必然是势能高地，一旦合作成功，产生的品牌能量，对全市场是具有俯冲效应的。6. 做品牌的价值投资者，相信时间的复利。 一个品牌诞生的最初，是一套识别系统，让用户能够把自己和其他人区分开来，让用户在竞争中能把自己识别和挑选出来。但是，随着品牌的成长，真正决定一个品牌长期竞争力的，是要从一套识别系统，升级为一套信用系统。因为只有信用，才能\u201c以不创新的方式实现长期创新\u201d，从而获取超出市场平均水平的收益。所以，从长期来看，营销的目的不是展现奇技淫巧，不是抓取眼球，不是猎奇和热闹。创业者在品牌问题上必须选择价值投资战略，积累品牌资产，或者说，只在那些能积累品牌资产的地方投入资源。最终形成自己的品牌资产观。得到App作为一家领先的知识服务机构，使命和责任就是要在各种可能的场景，为用户展现知识的魅力。这不是吸引注意力，而是为了增强用户与得到App之间的信用，扩展用户大脑中的认知带宽。罗振宇的\u201c罗胖60秒\u201d语音坚持了2000天，这是为用户的第一次下载得到App积累的信用；\u201c时间的朋友\u201d跨年演讲要坚持20年，这是为人们免费支持我们的菜市场展览积累的信用。我们的新slogan：\u201c知识就在得到\u201d，是一项需要长期积累的品牌资产。 信用，就是时间的复利。以上，是我们对这次活动的复盘。希望对所有正在思考未来市场演化的人，有帮助。最后，老规矩，附上本次活动核心参与者的\u201c演职人员名单\u201d。请允许我在此向他们中的每一个人致意，并隆重地感谢他们\u2014\u2014领衔\u201c主演\u201d：薛兆丰老师总\u201c导演\u201d：「得到」市场组牵头人 胡雯执行\u201c导演\u201d：小七 王钊 律诗策展人：廖尚勇 刁勇 助理策展人：吕晨 景杉艺术指导：李岩 内容指导：周克成 小马宋策展支持团队：王凯 刘静 王思琪 金彩琳 孙雪 杨晶 王莹 沈燕 王铁山 黄志伟 于漫 柳月 徐睿 邱伟诚 杨舟 于桄 陈思敏文案/传播支持团队：蛋壳文化 王爽 侯大银 骆志佳 苏婷人物海报摄影/设计：廖尚勇图片摄影：毛岩政 孙巍 黄吉哲视频团队：路景然 颂歌 坦克影像纪录片：张铁彪 郭思佳 周康康 张硕 特邀指导/艺术家：冯兮 张柘 芦钰淇 王艺蓉 宋猛 李庆午制作/现场搭建：何伟 陈小军 陈浩 胡显贵 蒲宣勇 何文兵 何江 郭立兵 王利奎 杨建伟 蒋智慧 奉有国 邓吉才 彭昌国 王伟鹏 魏仲豪 石根亮 温辉亮 唐玉英 马利红 赵明 「得到」支持团队：马想 柴颖娟 李倩 许晶 赵子裕 肖娴 何鹏 白丽丽 王迎雪 草地 狗哥 宋邦杰 王瑜 刘莎 邓婧 十三 阿狮 金文 李雪雯 徐昆鹏 牛萌 木三刀 陈轶男 刘甦 孙筱颖 梁荣辉 陆音 尹君慧 朱婷婷 李悦 楠小胖 陈睿 马晓蓉 焦焦 范新 宣宣 徐长安特别鸣谢：三源里菜市场 中信书店京城店三源里菜市场摊主：34号摊主李宏/李秋 42号摊主崔颖 43号摊主李学增 70号摊主李永军 85号摊主张小华 78号摊主杜伟 97号摊主张会珍 128号摊主周志银 等特约嘉宾：曹涤非 袁贤娴\n\n\n\n","url":"http://toutiao.com/group/6570874883725591053/","imageUrls":["http://p3.pstatp.com/large/pgc-image/1529900905317246fcfb08b","http://p3.pstatp.com/large/pgc-image/1529900826681a890eb6da0","http://p3.pstatp.com/large/pgc-image/1529900826720ede59eb408","http://p3.pstatp.com/large/pgc-image/1529900826743995bde522b","http://p9.pstatp.com/large/pgc-image/15299008267434a468ec720","http://p3.pstatp.com/large/pgc-image/15299008266428f94f1c203","http://p3.pstatp.com/large/pgc-image/15299008266282f5aca1c12","http://p9.pstatp.com/large/pgc-image/15299008266830ca35ee936","http://p1.pstatp.com/large/pgc-image/1529900826663364ad95f34"],"coverUrl":"http://p3.pstatp.com/list/pgc-image/1529900905317246fcfb08b","posterId":"51920067622_51917694327","posterScreenName":"得到","title":"得到为一本新书在菜市场办了艺术展","publishDate":1529901028,"id":"6570874883725591053","publishDateStr":"2018-06-25 12:30:28"},{"commentCount":0,"viewCount":0,"dislikeCount":0,"tags":null,"likeCount":0,"content":"\n\n\n\n\n\n文/我是大雁你是谁（原创）（我在泰国卖佛牌的日子）有感！看完这本书，我最大的感触就是有时候你得到的东西并非真正就得到，失去的就不一定是真正的失去！一个人如果管不住自己的欲望，会总是受到命运的作弄，一个人如果总想着投机取巧获得自己想要的东西，那么到最后自己会即使得到了也会转瞬即逝！一、文中多次提到\u201c情降\u201d一词！所谓情降，就是想让一个不爱的人爱上你的一种降头术。买主花高价让泰国阿赞给自己喜欢的那个人下降头，然后那个被你下降头不爱你的人会突然关心你，开始喜欢和你在一起。文中有好几次都提到好几个买主给别人下降头，但是最后当事买主要么死要么伤，其实两个人如果无缘你花多少心思也是徒劳，与其想尽一切办法讨好对方不如改变自己迎接自己的缘分！二、君子爱财，取之有道！有些人为了发财，买来黑衣阿赞的鬼牌来让自己发财，刚开始的确发财，时间长了，养不住小鬼的脾气，最后自己被小鬼伤害伤财。这件事告诉大家，如果想发财要看好项目，切合实际，不要搞旁门左道，时间久了，伤害的还是自己。三、得到即失去、失去即得到！文中作者田七，做了好多年佛牌生意，利润可观，在自己居住的城市买了三套房子，到最后，却把房子全卖了，捐出去了，因为他卖佛牌时期的所有逝去的冤亲债主都来找他索命。以为有钱了可以高枕无忧，其实并不是，只要不是按照正规途径获得的钱财，在获得钱财的道路上勾心斗角的人，到最后，总要竹篮子打水一场空。文中作者刚刚获得钱财的时候沾沾自喜，在亲戚朋友里也是被大家夸赞，但是没有人知道他经历了什么，后来他把房子捐了，被亲戚朋友鄙视着，但是他活的很坦然。其实，有时候，我们得到的不一定就真是得到，失去的也不一定是得到！\n\n\n\n","url":"http://toutiao.com/group/6566846818473214468/","imageUrls":["http://p1.pstatp.com/large/pgc-image/152896200466007ac4e2d51","http://p3.pstatp.com/large/pgc-image/1528962335624b492132214","http://p3.pstatp.com/large/pgc-image/1528962668318f6a267b0e6","http://p3.pstatp.com/large/pgc-image/152896281258004f9e8e93b"],"coverUrl":"http://p1.pstatp.com/list/pgc-image/152896200466007ac4e2d51","posterId":"68331739963_1577863612853261","posterScreenName":"我是大雁你是谁","title":"得到即失去，失去即得到！","publishDate":1528963171,"id":"6566846818473214468","publishDateStr":"2018-06-14 15:59:31"},{"commentCount":3,"viewCount":0,"dislikeCount":0,"tags":null,"likeCount":0,"content":"\n\n\n\n\n\n你好！今天，得到App，一所你我共建的终身大学，正式上线两周年。从此，我们将确立一个传统：每年5月26日，向你做一次汇报。 第一次汇报，将分三个部分：1. 认知清单：我们想清楚了什么？2. 行动清单：我们正在干什么？3. 蓝图清单：我们设想的未来是什么？我们的认知清单在过去两年里，「得到」服务了2000万用户，做了71个知识产品，已上线3788小时的严肃内容，同时，想清楚了10个命题\u2014\u20141. 新技术必将重新生产知识。在人类发展历史上，每当信息载体出现重大变革的时候，人类的学习方式就会产生革命性的变化，知识的生产和分发方式也会随之迭代。这家公司正在踏入一个\u201c古腾堡级\u201d的机会洪流。2. 我们要成为一个为人\u201c赋能\u201d的主体。荣耀用户、荣耀老师、荣耀同事。每天自我拷问：一切协作者是否因我们而变得更强大？他们是否以和我们站在一起为荣？3. 做时间的朋友，专注于管理长周期。这家公司的时间感，以十年为一个单位。凡产品，要从至少十年的尺度思考；重大业务板块的设立，要着眼于一百年以上的价值。4. 做知识的游牧民族。打破一切知识分科的壁垒，提供一切有价值的学习样式，以最终效果为产品交付标准。5. 打造理想中的通识教育。帮助你更高效率地构建自己的\u201c多元思维模型\u201d。 6. 在时间战场，只有头部才有价值。每出品一个产品，都必须占领一个认知高地。为此，我们不开放平台，只采取邀请制这一种合作方式，坚持守住市场上最严格的准入标准。7. 竞争意识会削弱竞争力。我们不关注竞争，只盯住终局，不争市场份额，只争夺公众认知。我们不对陌生人说话，只专注于提高已有用户的满意度。8. 开放透明、极度坦诚，是运营一个创造型团队的最有效手段。 9. 盯死 \u201c信用\u201d这个唯一目标。信用，买不来、偷不走、学不会；信用，可积累、可持续、可质变。长期来看，唯有信用可以驱动知识服务市场的需求增长。凡是偏离这个目标的动作，无论短期收益多大，都是陷阱。10. 坚定相信中国的未来。相信中国拥有世界上密度最高的奋斗者群体。相信这个群体必将培育出全球最大的知识服务市场。我们的行动清单我们正在推动下面这些事：1. 全面呈现\u201c终身大学\u201d的面貌。社会科学、人文艺术、自然科学、商学、能力、视野、听书、测评，八大内容版块完整上线。哲学、经济学、管理学、心理学、金融学、社会学、人类学、物理学、天文学、生命科学、医学、法学、中国传统文化、历史、数学、艺术、政治学等通识课程持续打磨中。2. 强化学习效果。让学习效果可感受、可呈现、可验证，完成线上线下的整合，探索新型的终身教育模式。3. 基于不可篡改的数据库，为你提供完整的学习记录和\u201c学分\u201d认证。让\u201c「得到」校友\u201d成为人才市场上更受欢迎、更有社会竞争力的一群人。 4. 把\u201c「得到」系老师\u201d打造成头部知识产品的标志。围绕他们展开精品出版、线下课堂等全面的知识服务。5. 为同事赋能，为同行赋能，推动\u201c知识服务者\u201d这个全新社会分工的形成。持续迭代和开源《「得到」品控手册》。促进整个行业的共建，共同为社会贡献价值。6. 和出版、电视、电影、教育等产业深度合作，尝试生产更高投入、多维立体的知识服务产品。两年前，我们只是想试试，优质严肃内容能不能实现用户付费？某一个夜晚，我们突然找到了\u201c为终身学习提供知识服务\u201d这个突破口。最初的一点微末之光，在我们眼前发生了\u201c宇宙大爆炸\u201d式的裂变。我们知道：我们是最幸运的创业者，找到了一个没有天花板的通道。从此根扎一处，无限生长。在未来一年里，请见证：「得到」将成为一家更专心的创业公司。我们的秘密蓝图既然都要公开了，为什么还是\u201c秘密蓝图\u201d？因为即使已经说出来，还是会有很多人不相信。把这些都公布给你，是因为我们想跟你一起，构建一个宏大而长远的共识。我们将按照如下次第，多点施工，逐步推进，直至抵达目标。1. 我们笃信\u201c飞轮效应\u201d。以完全的透明度，由慢及快地推动一只事业飞轮的转动。不摇摆、不旁顾、保一口真气不散。2. 飞轮的\u201c第一推动点\u201d是：只做最好的知识服务产品，以吸引你这样的终身学习者成为我们的用户。3. 飞轮的\u201c第二推动点\u201d是：凭借最优质的用户，邀请最好的知识服务者成为我们的老师。4. 飞轮的\u201c第三推动点\u201d是：打造一所\u201c通识大学\u201d，涵盖线上线下各种场景，回应现实世界的各种需求，提供这个时代最好的知识服务。它成功的标志是：就像那些传统名校一样，能为校友、为老师提供高价值的社会信用背书。 5. 以社会信用积累的高度，来衡量这只飞轮转动的速度。6. 紧盯人工智能、虚拟现实、区块链、脑机互联等一切新技术。把这只飞轮随时架设在最新的技术基础设施上。 7. 以上，并非创举。每一所世界上最好的学校，都曾用百年以上的时间，一再验证过这条道路。 是的，你没想错。「得到」的终极愿景，就是要\u2014\u2014建设一所全世界领先的新型通识大学。这所大学，不仅仅局限在线上。它的基础是最新的技术基础设施，致力于实现真正的自主教育、跨界认知和终身学习。当然，我们还差得很远，只走了第一步。今天，是2018年5月26日，得到App正式上线两周年。今天，是「罗辑思维」微信公众号每天发送一条60秒语音的第1983天。今天，是《罗辑思维》音视频节目的第500期。今天，我们承诺要做20年的《时间的朋友》跨年演讲，还剩17年。你看，虽然我们经常做得不够好，但是我们靠谱。我们没有什么可以依靠的，除了你。最后，邀请你来做一件事\u2014\u2014成为「得到」的赞助人。暂时，我们只需要一种赞助形式：你如果有意愿帮助我们，不管是在合适的时机向朋友推荐我们，还是为我们介绍优秀的老师。只需要有这个念头，你就将是这所通识大学的第一批赞助人。得到App将会在未来设立赞助人专区，专门记录所有帮助过我们的用户。就像那些传统名校的校友赞助名单一样。现在，你可以在下方留言区，或者回到得到App首页的\u201c留名专区\u201d，写下你的姓名和真实身份。你的名字，将以「得到」赞助人的身份被永久铭记。当然，如果哪一天你觉得我们背离了现在的宗旨，你可以严厉地批评我们，并要求擦去你的名字。赞助人，请留下你的姓名和真实身份。请接受我们永久的感激和敬意。祝夏安！「得到」团队：罗振宇、脱不花、快刀青衣、阿狮、蔡钰、池书进、杜若洋、范新、冯启娜、胡冰岐、李倩、李翔、李国刚、林飞扬、龙立恒、马想、沈仁奎、申强、孙筱颖、田靓、宣明栋、杨万里、曾捷、张文娟等320位全体同事2018年5月26日\n\n\n\n","url":"http://toutiao.com/group/6559708020761166349/","imageUrls":["http://p3.pstatp.com/large/pgc-image/1527300909683f1d933352e"],"coverUrl":"http://p3.pstatp.com/list/pgc-image/1527300909683f1d933352e","posterId":"51920067622_51917694327","posterScreenName":"得到","title":"得到App的秘密蓝图，以及它和你有什么关系","publishDate":1527301040,"id":"6559708020761166349","publishDateStr":"2018-05-26 10:17:20"},{"commentCount":0,"viewCount":0,"dislikeCount":0,"tags":null,"likeCount":0,"content":"\n\n\n\n\n\n努力想得到什么东西，其实只要沉着镇静、实事求是，就可以轻易地、神不知鬼不觉地达到目的。而如果过于使劲，闹得太凶，太幼稚，太没有经验，就哭啊，抓啊，拉啊，像一个小孩扯桌布，结果却是一无所获，只不过把桌上的好东西都扯到地上，永远也得不到了。\n\u2014\u2014卡夫卡 \u200b\u200b\u200b\n\n\n\n","url":"http://toutiao.com/group/6549151222413132301/","imageUrls":null,"coverUrl":null,"posterId":"52417509783_52416465884","posterScreenName":"胡撕乱享好产品","title":"想要得到什么东西","publishDate":1524843094,"id":"6549151222413132301","publishDateStr":"2018-04-27 23:31:34"},{"commentCount":3,"viewCount":0,"dislikeCount":0,"tags":null,"likeCount":0,"content":"\n\n\n\n\n\n\n\n心好似夜晚的教室 空空如也\n\n却仿佛又在想念什么\n\n想念当初的快乐 \n\n想念当初的热血\n\n想念她笨笨的笑容\n\n想念那熟悉而又陌生的背影\n\n她的笑容\n\n她的天真 \n\n她的背影\n\n勾走我的一切\n\n\n\n\n","url":"http://toutiao.com/group/6547825143563944452/","imageUrls":["http://p3.pstatp.com/large/pgc-image/152453399963271c8d8f3f0","http://p3.pstatp.com/large/pgc-image/1524534000267371231bab2","http://p3.pstatp.com/large/pgc-image/15245340007939efcac6f54","http://p9.pstatp.com/large/pgc-image/1524534005265f9b9be75b7","http://p1.pstatp.com/large/pgc-image/1524534005821b8c5417a52","http://p3.pstatp.com/large/pgc-image/152453400643802194055ad","http://p3.pstatp.com/large/pgc-image/15245340069492013b77562","http://p1.pstatp.com/large/pgc-image/15245340135986ee63fc859","http://p9.pstatp.com/large/pgc-image/1524534014219aae77edd27","http://p1.pstatp.com/large/pgc-image/15245340148799c40658ac8"],"coverUrl":"http://p1.pstatp.com/list/pgc-image/15245340135986ee63fc859","posterId":"58273362719_1568643798388738","posterScreenName":"嘀得里嘀","title":"得到她的青睐","publishDate":1524534342,"id":"6547825143563944452","publishDateStr":"2018-04-24 09:45:42"},{"commentCount":6,"viewCount":0,"dislikeCount":0,"tags":null,"likeCount":0,"content":"\n\n\n\n\n\n得到APP的目标用户是爱智求真的终身学习者，得到产品所能提供的核心价值是省时间的知识服务，那一起从文中来看看得到站内搜索功能的优化设计。站内搜索是一款优秀产品的重要组成部分，对于内容产品来说尤其重要，一个好的站内搜索本身就是自身优秀内容的优质营销渠道。接下来，我将从以下四个方面进行描述： 为什么研究站内搜索功能？这一部分重点分析站内搜索对于得到本身的意义和价值。得到的站内搜索为什么需要优化？这一部分结合调查问卷、访谈等多种调研渠道的结果进行梳理，找到目前存在的问题。得到的站内搜索该如何优化？这一部分重点将通过业务流程图、页面流程图等多种方式对优化方案进行描述。通过哪些指标评价设计的方案？这一部分对于实现效果的评价方式进行描述。一、得到站内搜索之于得到的价值得到APP的目标用户是爱智求真的终身学习者，「得到」产品所能提供的核心价值是省时间的知识服务。得到在实现其核心价值的过程中，采用的策略区别于其他信息流产品，以用户订阅为主要信息推送手段，得到将经过自己精选和精简后的知识服务提供给用户。站在知识提供者的角度，省时间的知识是将自己精选的优质且精简的信息传达给需要的用户；如果站在知识消费者的角度，省时间还有另外一种打开方式\u2014\u2014即搜索。下面将从三个方面来介绍搜索功能对于得到的价值：首先，从用户角度来看：优质的搜索功能会提升用户体验。在优质搜索功能的帮助下，用户在有知识需求的时候可以更高效，更精确的找到自己需要的内容。加之得到产品中具有无数高质量，多维度的知识存在于不同的知识体系中，优质的搜索结果将会给用户呈现出一类问题的多个视角，提升用户对知识的理解。其次，从内容角度来看：站内搜索功能让优质内容得到更多展示的机会。知识型产品不同于信息流产品，有自己独立的内容生态，好处是可以避免互联网的复制和传播，但同时也让优质内容丧失了被广泛传播的机会。站内搜索则提供了一种解决方案，在不失内容独立性的情况下，可以将优质内容进行二次的组合和展现，实现知识本身所具备的传播价值。最后，从产品角度来看：优秀的搜索功能是 \u201c使用搜索-订购内容\u201d正向循环的催化剂。一方面，优质的搜索功能和精准的搜索结果都会激发用户的购买行为，提升用户购买率，用户订阅的内容会越多。同时，根据笔者的调研结论1显示，使用时长越长、订阅专栏越多的用户，对搜索功能的依赖也就越强，形成搜索会增加订阅，订阅会促进搜索的正向循环，增强用户粘性。基于上述对得到产品搜索功能的重要性分析可以看出，无论是从用户角度、从内容角度、从产品角度来看，优质的搜索功能会对于平台产生巨大价值，增加产品内容的可寻性、提升用户体验、也提升产品的相关数据指标。二、 搜索功能的调研笔者针对搜索功能的调研采用用户访谈、用户反馈、调查问卷等多种方式。调研过程分为两个阶段：第一阶段为用户访谈及用户反馈调研；第二阶段为调查问卷。调查问卷依据第一阶段调研结果设计：先抛结论。调研阶段形成的 4 个调研结论如下： 专栏订阅数增加和产品使用时长增加会促进搜索功能的使用。产品使用时间越长，对于搜索的满意度越低。用户使用搜索功能的主要场景为查找搜索已订阅专栏内容，查找某一本书以及系统性学习某一方面的知识。搜索功能需要解决的问题是：展现结果页支持筛选或者排序、优展示内容具备相关度排序。2.1 用户访谈及产品反馈调研在第一阶段，笔者通过对5名得到用户的访谈，大致确定了得到搜索功能的满意程度以及相关问题，后续对各大应用商店中用户反馈意见的收集，整理相关反馈后形成下表。用户反馈第一阶段调研结果显示：用户对于得到站内搜索功能基本满意，但仍存在一些问题。总体来说有如下4点： 搜索已有内容无结果展示；搜索结果没有按照相关度进行展示；搜索结果展示页面无法进行二次筛选和排序；搜索界面交互设计问题。2.2 调查问卷根据第一阶段梳理的调研结果，笔者进行了问卷设计，发放和回收。其中，共回收问卷121份，其中110份为有效问卷。问卷地址为：https://www.wjx.cn/jq/20909000.aspx调研结论1：专栏订阅数增加和产品使用时长增加会促进搜索功能的使用基于产品粘性，ARPU值两个维度对产品进行分析，分别选取产品使用时长来表示代表用户粘性，使用订阅专栏数来表示ARPU值。通过调查问卷的2、4两题的分析结果与第6题进行交叉分析，将用户使用时长50小时作为使用时间多少的临界值，将订阅专栏数1作为订阅专栏多少的临界值进行区分，得出不同用户是否使用过得到的搜索功能，结果如下图所示： 第2题：您总共在\u201c得到\u201dapp中学习了多少小时？第4题：您订阅了几个\u201c得到\u201d专栏？第6题：您使用过得到的搜索功能吗？用户使用时长和订阅专栏数与搜索功能使用情况分析在订阅时长不变的情况下，订阅专栏数的增加会提升搜索的使用比例；在订阅专栏数不变的情况下，使用时长增长会提升搜索的使用比例。即产品使用时长的增加和订阅专栏数的增加，在一定程度上会提升产品的搜索使用比例。调研结论2：订阅专栏数量会影响搜索的满意度通过调查问卷的2、4两题的分析结果与第8题进行交叉分析，将用户使用时长50小时作为使用时间多少的临界值，将订阅专栏数1作为订阅专栏多少的临界值进行区分，得出不同用户对得到的搜索功能是否满意的结果。如下图所示： 第2题：您总共在\u201c得到\u201dapp中学习了多少小时？第4题：您订阅了几个\u201c得到\u201d专栏？第8题：您对于当时的搜索结果满意吗？用户使用时长和订阅专栏数与搜索满意度情况分析通过二维四象限分析法，分析不同用户使用时长和订阅专栏数下产品满意度的结果（满意和基本满意视为满意）。根据调研结果显示：订阅专栏数量对于产品满意度有一定影响，而产品使用时长则对产品满意度无明显影响。调研结论3：用户使用搜索功能的主要场景为查找搜索已订阅专栏内容，查找某一本书以及系统性学习某一方面的知识根据第7题对于用户使用搜索功能场景的调研显示：搜索功能的主要应用场景为查找已订阅专栏的某些内容，查找某一本书，其次为系统性的学习某一方面的知识，查看未订阅专栏内容和热门搜索的人较少。因此可以判断，用户使用得到的站内搜索功能更多的目的还是寻找已知内容，而非探索未知内容。第7题：你在什么场景下使用过搜索功能用户搜索事情场景分析同时，对于具体内容的分析可以看出：选择\u201c查找已订阅专栏的内容\u201d的人群比例，订阅专栏数多的用户数占据更大的比例。因此从另一个方面验证了，订阅专栏数的增加也促进了对专栏内容的搜索需求。调研结论4：站内搜索优化的方向为\u2014\u2014展现结果页支持筛选或者排序、搜索结果展示优化以及优化搜索算法通过9、10两题对于站内搜索功能改进方向的调研得出下方分析图表： 第9题：搜索过程中有遇到过下列问题吗？第10题：未来的搜索您最希望它具备哪些功能？得到搜索功能存在问题分析得到搜索功能改进建议分析根据上述的分析，得出初步的功能优化方案： 支持搜索笔记内容：目前产品搜索功能不支持搜索笔记内容；支持搜索大师课内容：目前产品搜索功能不支持搜索大师课文章内容；未订购专栏支持搜索：目前产品搜索功能几乎不支持搜索未订购专栏内容；展现结果页支持筛选或者排序：目前搜索结果页以简单的信息流形式存在，无二次筛选排序功能；优化搜索算法：目前产品搜索功能几乎不支持模糊搜索，关联搜索；优化搜索展示顺序及相关性：目前搜索结果的展示顺序没有考虑一定相关维度，有些标题相关的内容反而排在列表后边。针对调研得出的需优化功能，从用户数量和使用频率两个维度来对功能优先级进行排序，得出下方分析图表：得到搜索功能优化方向分析 最终，得出优先进行改进的功能为： 展现结果页支持筛选与排序功能：目前搜索结果页以简单的信息流形式存在，无二次筛选排序功能；搜索结果展示优化：支持按照相关度等关键指标进行排序；优化搜索算法：支持模糊搜索，关联搜索等搜索功能。三、搜索功能优化设计方案3.1 业务流程图根据调研结果3显示：用户使用搜索功能的场景主要是 ： 搜索订阅专栏的相关内容；搜索某一本书；系统性学习某一方面知识。用户在该类搜索场景下的搜索流程如下，其中黄色标注的内容是用户操作流程中需要进行优化的触点界面：3.2 页面流程图用户在使用搜索功能时，页面流程图如下所示，其中标记为黄色的页面是本次需要进行优化的页面：3.3 系统原型1）搜索结果相关度展示所有的结果展示页均默认按照相关度从大到小进行排序，涉及页面包括：音频列表页、电子书列表页、商品列表页、活动列表页、专栏列表页等页面。在页面展示中，相关度以进度条形式展现，显示在图片下方，如下图所示：相关度共分为5个等级（完全相关、非常相关、相关、比较相关、不太相关），相关度的计算指标由用户搜索的搜索词在文章标题，内容中的出现次数，历史用户搜索该关键词后点击该条内容的次数等指标构成。2）排序功能展示在专栏结果展示页新增排序功能，排序的主题有发布时间、学习人数两种排序方式。其中发布时间排序根据内容的创建时间倒序排列，学习人数排序根据内容的学习人数倒倒序排列。再次单击后还原原有排序状态，两种排序方式互斥，即勾选按照发布时间进行排序后无法同时根据学习人数进行排序。3）筛选功能设计在专栏搜索结果中增加筛选功能，筛选的范围根据进度逐步扩充，第一阶段先在全局搜索结果中支持筛选专栏，后期根据用户的使用频次和需求量逐步扩充筛选功能涉及的范围。界面上的筛选按钮可以进行点击，未点击时默认展现全部专栏的搜索结果，点击后展现出结果中用户订阅专栏的名称，点击相应专栏名称后，下方搜索结果只展现该专栏的搜索结果。筛选和排序共同作用于下方搜索结果，即选择学习人数排序，同时筛选专栏一后，下方内容按照专栏一内容的发布时间进行倒序展示。4）搜索算法设计整个搜索功能中，搜索算法是其核心功能，搜索结果的相关度算法和排序可以根据如下维度设计指标体系。四、原型结果统计分析根据Google Analytics对于站内搜索的分析度量指标可以看到，站内搜索优化后的评价指标主要有如下8个，分别是：搜索访问次数、唯一搜索总次数、结果页面浏览数/搜索次数、搜索退出率、搜索改进率、搜索后平均停留时间、搜索后平均浏览页面数、站内搜索利用率。同时，也需要对本次新增的排序按钮和筛选按钮进行埋点，计算按钮的点击次数。综合看来，对于此次得到站内搜索的衡量指标可以对上述指标进行整合，可以根据下述的评价指标来衡量搜索功能优化后的效果： 站内搜索有效性：用来分析站内搜索是否很好的实现其功能。通过计算搜索退出率、搜索改进率、平均浏览搜索结果页面数衡量，如果退出率和改进率低，平均浏览搜索结果页面数少则认为站内索越有效；站内搜索效果：通过搜索后平均停留时间和平均浏览页面数衡量；站内搜索价值：通过转化率，任务完成度，目标达到率进行衡量；筛选、排序按钮点击次数和点击比例：通过筛选和排序按钮的点击次数，结合用户画像的相关内容，为后续改进搜索展现机制提供帮助。五、总结凯文凯利在《必然》中提到：可寻性是使产品具备不可替代作用的重要方式，而搜索功能是实现内容可寻的重要途径。通过提升搜索结果的相关度和展现方式，让用户更方便，更快的找到需要的内容，提升用户使用搜索功能的频率，一定程度上提升用户粘性。希望上述的搜索功能优化设计可以提供一些帮助。本文由 @宋WADE 原创发布于人人都是产品经理。未经许可，禁止转载题图来自 Pexels ，基于 CC0 协议\n\n\n\n","url":"http://toutiao.com/group/6541963406470021646/","imageUrls":["http://p1.pstatp.com/large/78ad0004d7aefb8de88e","http://p3.pstatp.com/large/78ac00056d80b3d5c4db","http://p1.pstatp.com/large/78a9000ac19c0ae1b744","http://p3.pstatp.com/large/78ad0004d7af479cfff7","http://p3.pstatp.com/large/7579000d0d0d36c240e9","http://p3.pstatp.com/large/78ad0004d7b0e9733a95","http://p3.pstatp.com/large/78ad0004d7b159cd0fe5","http://p3.pstatp.com/large/78aa000abd147fa4b7b5","http://p3.pstatp.com/large/78aa000abd153cf71740","http://p1.pstatp.com/large/78aa000abd17e09d2036","http://p3.pstatp.com/large/78ab000578573aaf9c80","http://p9.pstatp.com/large/78ae0003f643dc6f57d4","http://p1.pstatp.com/large/78ae0003f6442f7ab8db","http://p3.pstatp.com/large/78aa000abd198af585ab"],"coverUrl":"http://p1.pstatp.com/list/78ad0004d7aefb8de88e","posterId":"3253636303_3253671606","posterScreenName":"人人都是产品经理","title":"\u201c得到\u201d站内搜索功能优化设计","publishDate":1523116800,"id":"6541963406470021646","publishDateStr":"2018-04-08 00:00:00"},{"commentCount":0,"viewCount":0,"dislikeCount":0,"tags":null,"likeCount":0,"content":"\n\n\n\n\n\n\u200b香老师:个人信用 传统的中国社会是只有\u201c王的信用\u201d的人治社会，个人征信的信息也一直是分散隔离的，缺乏信用社会的基础设施。我们国家个人信用资本化的两个明显趋势：生活场景不断转换成信用分，违约的惩罚机制成本降低。\n 武老师:创造写作 有创造力的写作，要去触碰真相，真相就是存在，而最深的存在就像是潜意识深处的水流，要深入其中去触碰，文字才能拥有直击人心的力量。在这个过程中，有效地投入极为重要，并且要保持真实，否则写出的内容不符合逻辑，缺乏真实的情感\n 傅老师:苏格拉底\n我们从小受教育，学到一些专业知识，但是千万不要因此而以为自己对其他事物也有所知，我们不知道的东西太多了。我们要保持一种求知的心态，保持一种好奇心，不断地去增加我们所知道的东西\n\n刘老师:心里定价\n心理物理学告诉我们，人类对数字的\u201c相对差异\u201d很敏感，但对\u201c绝对大小\u201d没感觉，于是定价专家就专门围绕\u201c比较\u201d二字，发明了\u201c心理定价\u201d策略。\n 宁老师:激励性报酬 如果只给市场上大家认为合理的价格，不会有激励效果。多给钱的同时，要注意有严格的考核和淘汰作为配套，有失败成本，效率工资的激励才有意义。 \n\n\n\n","url":"http://toutiao.com/group/6540416879092040196/","imageUrls":["http://p1.pstatp.com/large/pgc-image/15228094618068501b553d0"],"coverUrl":"http://p1.pstatp.com/list/pgc-image/15228094618068501b553d0","posterId":"4312557316_1579730532953101","posterScreenName":"丹菡的蜗牛慢生活","title":"今日得到:","publishDate":1522809471,"id":"6540416879092040196","publishDateStr":"2018-04-04 10:37:51"},{"commentCount":4,"viewCount":0,"dislikeCount":0,"tags":null,"likeCount":0,"content":"\n\n\n\n\n\n\u201c得到\u201dAPP，每天半小时，搞懂一本书。这是罗振宇在9月1日的\u201c002号知识发布会\u201d上的宣传文案。从文案角度来看，这简直可以算是互联网文案的范本，既符合互联网时代简洁易记的广告特性，又完美地展示出了\u201c得到\u201d的定位和价值所在，让每一个听说过没听说过\u201c得到\u201dAPP的人单单看到这句话就会产生明确的认知和强烈的好奇心。但从\"得到\"APP的实质来看，这句文案更像是一个迷惑人的面纱。广告将\u201c得到\u201dAPP塑造成一个碎片化知识学习的有效平台，只要用半个小时，就能搞懂一本原来需要花费4、5个小时才能看完的十几万字书本。的确，全世界有220万种书，人类图书有3.1亿本，每天传播的信息不可胜数，好看的书太多、要知道的知识太多，而我们的时间却很有限，就算穷其一生也读不完其中的一个角落。在讲求速度和竞争的当代，\u201c得到\u201d的出现契合了我们对资源获取的深切焦虑。在专业拆书人的解读下，一本书的核心思想凝练在几千字的范围内，用通俗易懂的语音传输出来，让我们快速接收到知识。问题是，我们真的得到知识了吗？一般情况下，得到知识的方式有两种：他人教授与自我体验。他人教授的方式我们并不陌生，十几年的学生生涯，三尺讲台上，老师看着教材，拿着粉笔给我们说着一个个知识点。有人说，\u201c得到\u201d不也正是这样的模式吗？只不过传授知识的人由老师换成了专家而已，这两者其实并没有区别。真的是这样么？我们将\u201c得到\u201d与最相近的语文教学进行对比：两者都会学习著作，但两者学习的内容和目的有很大差别。语文老师会把著作选篇拿出来一句句一段段具体解读，分析作者写作目的、写作方式、论证过程、内在情感，向你展示文字里隐藏的魅力。而\u201c得到\u201d是把作者苦心孤诣架构出来的格局打破，将里面的知识进行整合、聚焦，去除掉作者原本占据大部分篇幅的论证，罗列出论证结果，然后以语音的方式加以呈现。这就像一个人要给你讲《小红帽》的故事，他说，《小红帽》就是一个带小红帽的女孩机智地发现躺在床上的是假扮外婆的狼，在猎人的帮助下杀死狼救出外婆的故事。这个故事告诉我们要善于观察，机智勇敢对抗敌人。就这样，\u201c得到\u201d让故事只剩下一个故事脉络、结局，和一个本应读者自己思考的启发。这样的脉络化碎片化的知识真的是我们需要的吗？除了假装自己很有文化，听了很多书，知道很多书里的核心思想外，我们还能得到什么？且不去讨论\u201c得到\u201d的专家是否都是资格极深，单看这种拆书的方式，就会不可避免地带上拆书人的个人认知和偏向。这种认知又真的适合每一个听者吗？都说\u201c一千个读者就有一千个哈姆雷特\u201d，对于读者而言，带着自己独特的认知与经验进入作者所塑造的世界，感受有别于自己人生的经历、思考全然不同的思维方式，才是阅读的魅力所在。\u201c得到\u201d看似将为我们节省大量宝贵的时间，但与此同时也剥夺了静下来阅读的自我体验以及我们独立思考的方式，它要直接把装满知识的奶瓶塞进我们的嘴里，披着善解人意的外衣用温柔的话语告诉我们：不用阅读，别思考，乖乖接受就好。结果，我们得到了太过零碎的知识，接受地多了，内心的焦虑反而有增无减。\u201c得到\u201dAPP，很显然，是罗振宇曾提到过的\u201c母性思维\u201d和\u201c父性思维\u201d的完美结合体。它满足了我们快速获取知识的需求，又以一种假装温柔的强硬灌输给我们不用选择不用思考的思想结论。让我们在知识领域也变成了嗷嗷待哺的懒惰巨婴。其实，人生虽短，但将时光花费在阅读上是很美好的一件事，一个人静下来细细阅读才能延展出自我时间的宽度、开拓出思想的深度。文/云谷\n\n\n\n","url":"http://toutiao.com/group/6462641220345659918/","imageUrls":["http://p3.pstatp.com/large/39a80003df2b56ceedd5"],"coverUrl":"http://p3.pstatp.com/list/39a80003df2b56ceedd5","posterId":"52010440827_52011386789","posterScreenName":"连讯社","title":"\u201c得到\u201dAPP让我们得到了什么？","publishDate":1504700915,"id":"6462641220345659918","publishDateStr":"2017-09-06 20:28:35"},{"commentCount":149,"viewCount":0,"dislikeCount":1,"tags":null,"likeCount":7,"content":"\n\n\n\n\n\n恋爱两年半后，我和男友安鑫准备结婚了。已经看好了要买的婚房，也交了定钱，就差付款了。那天太开心了，我们两个喝了很多酒，酒便乱了我这个传统女子的心，于是，我和安鑫有了一次亲密接触。几天后的周末，我按照事先计划好的给安鑫打电话，问他怎么还没来接我？不是说好了一起去交房子首付款吗？安鑫的语气里有了一份从来没有过的淡定：\u201c你忙什么？要是实在太着急，你自己去付吧。\u201d女人的直觉告诉我，他这微妙的变化和那件事有关，可能他心里认为我这么传统的女子，一旦得到了我，就可以吃定我了。图片来源网络等到下午，我去了安鑫家，问他什么意思？安鑫没等回答，他母亲抢先回答说：\u201c现在我们手头有点紧，要不这样，叫你爸妈先拿出钱来，把首付支付了，以后房贷我们还。\u201d呦呦呦，我没有听错吧？本来好好的计划，怎么就变了？我不动声色：\u201c不是说好的，你们付首付，我爸妈拿装修款吗？\u201d\u201c先把首付支付了吧，至于装修，让他们再想想办法。\u201d安鑫母亲说这话的时候眼睛都没眨一下，那样子仿佛我一定会答应。安鑫也看着我，还皱着眉头，带着几分不耐烦：\u201c你怎么这么墨迹呀，你家先支付了能死呀？你父母就不为难考虑一下吗？\u201d懂了懂了全懂了，这母子以为吃定我了，所以开始翻脸了。这还了得？还没结婚就敢这样，这要是结了婚，还不得让我给跪着呀？图片来源网络我怒极而笑，看着他们，用清晰无比、轻蔑无比的语气说：\u201c你们醒醒吧，大清朝都亡多少年了，还想拿封建教条要挟我？我告诉你，那一次算我赠送给你的。\u201d图片来源网络说完，我转身走了。十几秒后，身后传来安鑫急切的叫声，我冷笑着摇头，远去。\n\n\n\n","url":"http://toutiao.com/group/6449202119814677006/","imageUrls":["http://p1.pstatp.com/large/31d70004823de193ffdd","http://p3.pstatp.com/large/31d90004542c684cbb07","http://p3.pstatp.com/large/31d80002057012dff90b"],"coverUrl":"http://p1.pstatp.com/list/31d70004823de193ffdd","posterId":"51840635700_51839058981","posterScreenName":"水墨不倾城","title":"以为得到了我一次，就得到了我一生？","publishDate":1501571881,"id":"6449202119814677006","publishDateStr":"2017-08-01 15:18:01"},{"commentCount":12,"viewCount":0,"dislikeCount":0,"tags":null,"likeCount":0,"content":"\n\n\n\n\n\n不必太过斤斤计较，愿意吃亏的人，终究吃不了亏，吃亏多了，总有厚报；爱占便宜的人，定是占不了便宜，赢了微利，却失了大贵。人们心神不宁是因为总是拿自己平淡不起眼的生活与别人光鲜亮丽的一面相比较。提醒一点，最好不要找正处在事业巅峰期的男人。他可能是你想要的那种成功男性，但你不一定会是他真正需要的女人。每个男人的精力、能力和荷尔蒙都有高潮和低潮，当他没有达到高潮时，他需要女人承载他帮助他；当他到达高潮时，就会肆无忌惮、无所顾忌；当他从高潮降落时，他才会清醒地知道自己需要什么样的女人。聪明的女人要学会在什么时候接触什么样的男人。在男人忘乎所以的时候就离他远一点，那时候的他不真实。你不能通过生活的点点滴滴展望未来，但你能透过它回顾过去，因此你必须相信这些点滴将与你的未来相联系，你必须相信一些东西--你的内在、命运、因缘等等。这种方法使我从不失落，也使极大地改变了我的人生。不是每个追求你的人都是值得信任。对你好，总有目的：有些人是想要占有你，而有些人是想要保护你。想占有你的人，虽然追求的时候千好万好，可一旦得到，他就不在乎了。而想保护你的人，才会默默陪着你一生。为你的身体而来的人，也会为别的身体而走。只有为你心而来的人，才会长久。越有故事的人越沉静简单，越肤浅单薄的人越浮躁不安。比麻烦更可怕的是，我们相信自己做什么都没有用，然后我们便心安理得地什么都不做。一些杜绝语言的厌倦，一些失去期待的绝望，没有人可以爱，也不想爱上任何人，不相信爱情的人，只是因为曾经沧海的心情，已经不是常人能够体会。身边总有些人，你看见她整天都开心，率真得像个小孩，人人都羡慕她；其实，你哪里知道：前一秒人后还伤心地流着泪的她，后一秒人前即刻洋溢灿烂笑容。他们其实没有能力独处，夜深人静时，总坐在窗前对着夜空冥想失意的苦楚。他们就像向日葵，向着太阳的正面永远明媚鲜亮，在照不到的背面却将悲伤深藏。当你失恋了一次，就好像突然明白了所有情歌的含义。\n\n\n\n","url":"http://toutiao.com/group/6318922750548689153/","imageUrls":["http://p3.pstatp.com/large/c1400051d83ffb54b2b","http://p1.pstatp.com/large/bdb00053b22e24da4c9","http://p3.pstatp.com/large/bdb00053b25ce09fc84","http://p1.pstatp.com/large/bdb00053b213070ff14","http://p3.pstatp.com/large/c1400051d81cec96044","http://p1.pstatp.com/large/c1400051d82f31230e3","http://p9.pstatp.com/large/c100008b784f8c5e49f","http://p1.pstatp.com/large/c100008b78591d5bb49","http://p3.pstatp.com/large/c110005262d3ac51e2f","http://p3.pstatp.com/large/c11000528d92b827855"],"coverUrl":"http://p3.pstatp.com/list/c530000f576601e65c0","posterId":"6825684703_6825893345","posterScreenName":"励志心语","title":"太难得到的好句，得到就赚到","publishDate":1471239729,"id":"6318922750548689153","publishDateStr":"2016-08-15 13:42:09"}]
     * appCode : toutiao
     * pageToken : 20
     * dataType : news
     * hasNext : true
     */

    private String retcode;
    private String appCode;
    private String pageToken;
    private String dataType;
    private boolean hasNext;
    private List<DataBean> data;

    public String getRetcode() {
        return retcode;
    }

    public void setRetcode(String retcode) {
        this.retcode = retcode;
    }

    public String getAppCode() {
        return appCode;
    }

    public void setAppCode(String appCode) {
        this.appCode = appCode;
    }

    public String getPageToken() {
        return pageToken;
    }

    public void setPageToken(String pageToken) {
        this.pageToken = pageToken;
    }

    public String getDataType() {
        return dataType;
    }

    public void setDataType(String dataType) {
        this.dataType = dataType;
    }

    public boolean isHasNext() {
        return hasNext;
    }

    public void setHasNext(boolean hasNext) {
        this.hasNext = hasNext;
    }

    public List<DataBean> getData() {
        return data;
    }

    public void setData(List<DataBean> data) {
        this.data = data;
    }

    public static class DataBean {
        /**
         * commentCount : 0
         * viewCount : 0
         * dislikeCount : 0
         * tags : null
         * likeCount : 0
         * content :





         叁品姐姐每天分享一段爱情感悟，幸福可以很简单，点击右上角关注“叁品姐姐的小幸福”。1 一生不喜与人抢，但该得到的也不会让。2 我可以笑着给你讲道理，也可以翻脸告诉你什么叫规矩。3 打破自己原则和底线坚持的感情，结局一定会烂尾。4 哪有什么感同身受，谁不是针扎在身上才知道痛。5 你不喜欢我，这是病，得治。我喜欢你，这也是病，没得治。6 我从来都没被人骗过，因为骗我的都不是人。7 迟睡，是因为没有勇气结束这一天；赖床，是因为没有勇气开始这一天。8 光头强砍不到树，灰太狼吃不到羊，就像你永远不会爱我。9 爱和喜欢的区别很简单，如果你爱花，你会给它浇水，喜欢则会摘下它。10 不必对每个人都好，他们又不给你打钱！11 哪有什么岁月静好，不过是有人替你负重前行。12 不要太乖，不想做的事可以拒绝，做不到的事不用勉强，不喜欢的话假装没听见，你的13 人生不是用来讨好别人，而是善待自己。更多情感美学、更多爱情感悟，和叁品姐姐一起成长，点击下方“了解更多”




         * url : http://toutiao.com/group/6570491501753664003/
         * imageUrls : ["http://p1.pstatp.com/large/pgc-image/1529811707863f53b519459","http://p3.pstatp.com/large/pgc-image/15298117084151b47ddda21","http://p1.pstatp.com/large/pgc-image/152981170878549cc4c2ac5","http://p3.pstatp.com/large/pgc-image/1529811709276a1183a3c21"]
         * coverUrl : http://p1.pstatp.com/list/pgc-image/152981170878549cc4c2ac5
         * posterId : 60433889019_1567543265913858
         * posterScreenName : 叁品姐姐的小幸福
         * title : 最近微信上很火的霸气句子，一生不喜与人抢，但该得到的也不会让
         * publishDate : 1530060994
         * id : 6570491501753664003
         * publishDateStr : 2018-06-27 08:56:34
         */

        private int commentCount;
        private int viewCount;
        private int dislikeCount;
        private Object tags;
        private int likeCount;
        private String content;
        private String url;
        private String coverUrl;
        private String posterId;
        private String posterScreenName;
        private String title;
        private int publishDate;
        private String id;
        private String publishDateStr;
        private List<String> imageUrls;

        public int getCommentCount() {
            return commentCount;
        }

        public void setCommentCount(int commentCount) {
            this.commentCount = commentCount;
        }

        public int getViewCount() {
            return viewCount;
        }

        public void setViewCount(int viewCount) {
            this.viewCount = viewCount;
        }

        public int getDislikeCount() {
            return dislikeCount;
        }

        public void setDislikeCount(int dislikeCount) {
            this.dislikeCount = dislikeCount;
        }

        public Object getTags() {
            return tags;
        }

        public void setTags(Object tags) {
            this.tags = tags;
        }

        public int getLikeCount() {
            return likeCount;
        }

        public void setLikeCount(int likeCount) {
            this.likeCount = likeCount;
        }

        public String getContent() {
            return content;
        }

        public void setContent(String content) {
            this.content = content;
        }

        public String getUrl() {
            return url;
        }

        public void setUrl(String url) {
            this.url = url;
        }

        public String getCoverUrl() {
            return coverUrl;
        }

        public void setCoverUrl(String coverUrl) {
            this.coverUrl = coverUrl;
        }

        public String getPosterId() {
            return posterId;
        }

        public void setPosterId(String posterId) {
            this.posterId = posterId;
        }

        public String getPosterScreenName() {
            return posterScreenName;
        }

        public void setPosterScreenName(String posterScreenName) {
            this.posterScreenName = posterScreenName;
        }

        public String getTitle() {
            return title;
        }

        public void setTitle(String title) {
            this.title = title;
        }

        public int getPublishDate() {
            return publishDate;
        }

        public void setPublishDate(int publishDate) {
            this.publishDate = publishDate;
        }

        public String getId() {
            return id;
        }

        public void setId(String id) {
            this.id = id;
        }

        public String getPublishDateStr() {
            return publishDateStr;
        }

        public void setPublishDateStr(String publishDateStr) {
            this.publishDateStr = publishDateStr;
        }

        public List<String> getImageUrls() {
            return imageUrls;
        }

        public void setImageUrls(List<String> imageUrls) {
            this.imageUrls = imageUrls;
        }
    }
}
